### Intro to DataFrame

In [8]:
import pandas as pd

In [9]:
df = pd.DataFrame([[1,2,3], [4,5,6], [7,8,9]])

In [10]:
type(df)

pandas.core.frame.DataFrame

In [11]:
df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [12]:
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [14]:
df.head()

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9